In [3]:
import pandas as pd

In [4]:
DD = pd.read_csv('results/30_heurMercedes.csv')
AP = pd.read_csv('results/30_heurMercedes_AP.csv')
NC = pd.read_csv('results/30_heurMercedes_NC.csv')
DD = DD.drop_duplicates(subset='instance', keep='last')
AP = AP.drop_duplicates(subset='instance', keep='last')
NC = NC.drop_duplicates(subset='instance', keep='last')

AP['instance'] = "AP/" + AP['instance']
NC['instance'] = "NC/" + NC['instance']

# Filtra i record di DD che contengono la sottostringa 'nDe1'
DD1 = DD[DD['instance'].str.contains('nDe1')]
DD2 = DD[DD['instance'].str.contains('nDe2')]
DD3 = DD[DD['instance'].str.contains('nDe3')]

In [7]:
print("Top 5 righe con il valore totalTime pi첫 alto:")
display(DD.nlargest(5, 'totalTime')[["instance","totalTime"]])
display(AP.nlargest(5, 'totalTime')[["instance","totalTime"]])
display(NC.nlargest(5, 'totalTime')[["instance","totalTime"]])

print("\nTop 5 righe con il valore totalTime pi첫 basso:")
display(DD.nsmallest(5, 'totalTime')[["instance","totalTime"]])
display(AP.nsmallest(5, 'totalTime')[["instance","totalTime"]])
display(NC.nsmallest(5, 'totalTime')[["instance","totalTime"]])

Top 5 righe con il valore totalTime pi첫 alto:

                 instance    totalTime
1769  metroplex63nDr0nDe3  1436.318366
1767       grid89nDr0nDe2   667.634534
1764       grid89nDr0nDe1   642.733865
1751       grid48nDr0nDe3   637.072111
1768       grid73nDr0nDe3   634.442574

           instance   totalTime
509       AP/grid22  692.814005
515       AP/grid39  692.203033
587  AP/metroplex62  675.964465
530       AP/grid57  665.644590
497       AP/grid15  665.214196

           instance   totalTime
527  NC/metroplex82  762.350510
525       NC/grid10  758.298427
524       NC/grid36  703.408476
523       NC/grid12  672.820266
522       NC/grid31  592.647741

Top 5 righe con il valore totalTime pi첫 basso:

                 instance  totalTime
1046     airport2nDr0nDe3   0.324829
967   metroplex31nDr0nDe3   0.330140
889   metroplex19nDr0nDe2   0.337359
891     airport13nDr0nDe1   0.367011
971     airport30nDr0nDe2   0.368493

         instance  totalTime
315  AP/airport41   4.404962
294   AP/airport1   6.673057
320  AP/airport42   6.758870
295  AP/airport23   7.008249
356  AP/airport72   7.461871

         instance  totalTime
274  NC/airport38   2.276715
257  NC/airport25   2.287517
285   NC/airport4   2.860375
335  NC/airport97   2.924773
298  NC/airport59   2.969290

In [6]:
with open("/home/magi/UAMdeconflictionMasterThesis/modelli/temp/file_list.txt", "w") as f:
    for file in DD1.nlargest(5, 'totalTime')["instance"]:
        f.write(file + "\n")    
    for file in DD2.nlargest(5, 'totalTime')["instance"]:
        f.write(file + "\n")    
    for file in DD3.nlargest(5, 'totalTime')["instance"]:
        f.write(file + "\n")
    for file in AP.nlargest(5, 'totalTime')["instance"]:
        f.write(file + "\n")
    for file in NC.nlargest(5, 'totalTime')["instance"]:
        f.write(file + "\n")
    for file in DD1.nsmallest(5, 'totalTime')["instance"]:
        f.write(file + "\n")
    for file in DD2.nsmallest(5, 'totalTime')["instance"]:
        f.write(file + "\n")
    for file in DD3.nsmallest(5, 'totalTime')["instance"]:
        f.write(file + "\n")
    for file in AP.nsmallest(5, 'totalTime')["instance"]:
        f.write(file + "\n")
    for file in NC.nsmallest(5, 'totalTime')["instance"]:
        f.write(file + "\n")